load-tests/artillery/load-test.yml
# load-tests/artillery/load-test.yml
# Phase B equivalent: ~1 RPS constant for 10 minutes.
#
# NOTE on rate equivalence: k6's load-test uses 0.5 RPS (rate:1, timeUnit:'2s').
# Artillery's minimum arrivalRate is 1 new user/sec, making a true 0.5 RPS impossible
# in standard Artillery config without plugins. This test runs at 1 RPS — 2× the k6 rate.
# When comparing results, factor this in: Artillery's load test is intentionally a
# slightly higher load. Use it to observe the shape of the metrics, not to produce
# a directly comparable number to k6's 0.5 RPS run.
#
# The `expect` plugin must be declared in config.plugins for assertions to be evaluated.

config:
  target: "http://108.130.216.13:3000"
  plugins:
    expect: {}
  phases:
    - duration: 600       # 10 minutes
      arrivalRate: 1      # 1 new user/sec = ~1 RPS (≈2× k6's 0.5 RPS — see note above)
      name: "Load test"
  ensure:
    # Artillery v2 ensure syntax — uses full metric path
    thresholds:
      - "http.response_time.p95": 500   # fail if p95 exceeds 500ms
    maxErrorRate: 1                      # fail if error rate exceeds 1%

scenarios:
  - name: "Health check load"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200