load-tests/artillery/smoke-test.yml
# load-tests/artillery/smoke-test.yml
# Phase A equivalent: 5 new virtual users arriving per second for 30 seconds.
#
# IMPORTANT — Artillery's arrival rate model differs from k6's VU model:
#   k6:       vus: 5          → 5 concurrent long-lived users, each looping with sleep(1)
#   Artillery: arrivalRate: 5 → 5 NEW users created every second; each fires its scenario once
#
# At arrivalRate: 5 for 30s, Artillery spawns ~150 users total and fires ~150 requests.
# k6 with vus: 5, sleep(1), duration: 30s also fires ~150 requests.
# The total request counts are comparable, but the concurrency model is different.
#
# The `expect` plugin must be declared in config.plugins for assertions to be evaluated.
# Without the declaration, expect: blocks are silently ignored — no failures, no output.

config:
  target: "http://108.130.216.13:3000"
  plugins:
    expect: {}
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Smoke test"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health check"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"