load-tests/artillery/stress-test.yml
# load-tests/artillery/stress-test.yml
# Phase C + D equivalent: ramp arrival rate from 1 to 30, then recover.
# Artillery's rampTo ramps arrival rate linearly within each phase.
#
# IMPORTANT — Artillery does NOT support rampTo: 0. Ramping to zero causes a
# runtime error or invalid behaviour depending on Artillery version. The recovery
# phase uses arrivalRate: 1 (minimum valid value) as a cooldown instead.
# Compare recovery by watching error rate in the final phase drop back to 0%.

config:
  target: "http://108.130.216.13:3000"
  phases:
    - duration: 12
      arrivalRate: 1
      rampTo: 5
      name: "Ramp to 5 RPS"
    - duration: 12
      arrivalRate: 5
      rampTo: 10
      name: "Ramp to 10 RPS"
    - duration: 12
      arrivalRate: 10
      rampTo: 20
      name: "Ramp to 20 RPS"
    - duration: 12
      arrivalRate: 20
      rampTo: 30
      name: "Push to 30 RPS"
    - duration: 18
      arrivalRate: 1
      name: "Recovery cooldown (Phase D) — minimum rate, observe error rate dropping to 0"

scenarios:
  - name: "Stress health check"
    flow:
      - get:
          url: "/health"